In [2]:
#一個一個讀取groupby物件內的值
import numpy as np
import pandas as pd

df = pd.DataFrame({'key1':['a', 'a', 'b', 'b', 'a'],
                  'key2':['one', 'two', 'one', 'two', 'one'],
                  'data1': np.random.randn(5),
                  'data2':np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one -0.263575 -0.246152
1    a  two  0.765991 -0.487416
2    b  one  0.328006 -0.800323
3    b  two  0.151784 -0.849373
4    a  one -0.261233  1.792409

In [3]:
grouped = df.groupby('key1')
for name, group in grouped:
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one -0.263575 -0.246152
1    a  two  0.765991 -0.487416
4    a  one -0.261233  1.792409
b
  key1 key2     data1     data2
2    b  one  0.328006 -0.800323
3    b  two  0.151784 -0.849373

In [6]:
grouped = df.groupby(['key1', 'key2'])
for name, group in grouped:
    print(name)
    print(group)

('a', 'one')
  key1 key2     data1     data2
0    a  one -0.263575 -0.246152
4    a  one -0.261233  1.792409
('a', 'two')
  key1 key2     data1     data2
1    a  two  0.765991 -0.487416
('b', 'one')
  key1 key2     data1     data2
2    b  one  0.328006 -0.800323
('b', 'two')
  key1 key2     data1     data2
3    b  two  0.151784 -0.849373

In [7]:
df

  key1 key2     data1     data2
0    a  one -0.263575 -0.246152
1    a  two  0.765991 -0.487416
2    b  one  0.328006 -0.800323
3    b  two  0.151784 -0.849373
4    a  one -0.261233  1.792409

In [8]:
grouped = df.groupby('key1')
grouped

In [12]:
pieces=dict(list(grouped))
pieces

{'a':   key1 key2     data1     data2
 0    a  one -0.263575 -0.246152
 1    a  two  0.765991 -0.487416
 4    a  one -0.261233  1.792409, 'b':   key1 key2     data1     data2
 2    b  one  0.328006 -0.800323
 3    b  two  0.151784 -0.849373}

In [13]:
pieces['a']

  key1 key2     data1     data2
0    a  one -0.263575 -0.246152
1    a  two  0.765991 -0.487416
4    a  one -0.261233  1.792409

In [14]:
pieces['b']

  key1 key2     data1     data2
2    b  one  0.328006 -0.800323
3    b  two  0.151784 -0.849373

In [15]:
df

  key1 key2     data1     data2
0    a  one -0.263575 -0.246152
1    a  two  0.765991 -0.487416
2    b  one  0.328006 -0.800323
3    b  two  0.151784 -0.849373
4    a  one -0.261233  1.792409

In [16]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [17]:
grouped = df.groupby(df.dtypes, axis=1)
for dtype, group in grouped:
    print(dtype)
    print(group)

float64
      data1     data2
0 -0.263575 -0.246152
1  0.765991 -0.487416
2  0.328006 -0.800323
3  0.151784 -0.849373
4 -0.261233  1.792409
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

In [21]:
#groupby後,選取一個欄位或多個欄位
#選取一個欄位就得到SeriesGroupBy
#選取多個欄位就得到DataFrameGroupBy
grouped = df.groupby('key1')
means=grouped.mean()
means

         data1     data2
key1
a     0.080394  0.352947
b     0.239895 -0.824848

In [22]:
means['data1']

key1
a    0.080394
b    0.239895
Name: data1, dtype: float64

In [25]:
grouped = df.groupby('key1')
grouped['data1'].mean()

key1
a    0.080394
b    0.239895
Name: data1, dtype: float64

In [28]:
grouped[['data1']].mean()

         data1
key1
a     0.080394
b     0.239895

In [29]:
grouped[['data1', 'data2']].mean()

         data1     data2
key1
a     0.080394  0.352947
b     0.239895 -0.824848

In [30]:
df

  key1 key2     data1     data2
0    a  one -0.263575 -0.246152
1    a  two  0.765991 -0.487416
2    b  one  0.328006 -0.800323
3    b  two  0.151784 -0.849373
4    a  one -0.261233  1.792409

In [34]:
#使用階層索引群組
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'],
                                    [1, 3, 5, 1, 3]],
                                   names=['cty', 'tenor'])
hier_df = pd.DataFrame(np.random.randn(4, 5),
                      columns=columns )
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0     -0.553635  0.343982  0.287383  0.152884 -0.395220
1     -1.696853 -0.841027  0.091587  1.833828 -0.546490
2      1.446462 -0.129796 -1.779905 -0.339291 -0.444832
3      1.238675 -1.198167 -0.184289  0.954541  1.033309

In [33]:
hier_df.groupby(level='cty',axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3